{
  "backend/main.mo": "Main Motoko actor defining the backend canister with user profile management, job/work order CRUD, and role-based access control using Auth and MixinAuthorization modules.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Dashboard, Jobs, CRM, Invoicing, etc.) to their corresponding frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line descriptions of each frontend source file, noting key fixes and responsibilities for pages and components.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the React app titled 'SKPM Technical Services' that mounts the app into a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React application file that sets up TanStack Router with all page routes under an authenticated layout, handling Internet Identity login and profile setup.",
  "frontend/src/components/CustomerForm.tsx": "Modal dialog form component for creating and editing customer records with fields for name, company, email, phone, address, type, and notes.",
  "frontend/src/components/InventoryForm.tsx": "A dialog form component for creating and editing inventory items, with fields for name, SKU, category, quantity, cost, and supplier. Uses React Query mutations to persist data and shows toast notifications on success or failure.",
  "frontend/src/components/InvoiceForm.tsx": "A dialog form component for creating and editing invoices, supporting dynamic line items, tax calculation, customer/job selection, and payment status. Computes subtotal, tax, and total in real time and persists via React Query mutations.",
  "frontend/src/components/JobForm.tsx": "A dialog form component for creating and editing service jobs, with fields for title, customer, technician, priority, status, scheduled date, and location. Submits data through React Query mutations with toast feedback.",
  "frontend/src/components/Layout.tsx": "The main application shell providing a responsive sidebar navigation with links to all major sections, user profile display, and a logout button. Uses TanStack Router for active-route detection and Internet Identity for authentication state.",
  "frontend/src/components/ProfileSetupModal.tsx": "A blocking modal dialog that collects a new user's name, email, and role on first login. Calls the provided onSave callback with the UserProfile data and prevents dismissal until saved.",
  "frontend/src/components/SeedDataLoader.tsx": "A renderless component that runs seed data initialization once when the actor is ready, then invalidates all React Query caches to reflect the seeded state.",
  "frontend/src/components/TechnicianForm.tsx": "A dialog form component for creating and editing technician records, with fields for name, email, phone, specialization, skills, status, and notes. Persists changes via React Query mutations with toast notifications.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, login status, and helper flags to child components.",
  "frontend/src/hooks/useQueries.ts": "Exports a comprehensive set of React Query hooks (queries and mutations) for all backend entities including jobs, customers, invoices, technicians, inventory, and user profiles.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS, and defines a navy/steel field-service design system with CSS custom properties for both light and dark themes.",
  "frontend/src/lib/seedData.ts": "Utility function that seeds the backend with sample customers, technicians, and jobs if the database is empty, used for development and demo purposes.",
  "frontend/src/lib/utils.ts": "Utility module providing helper functions for class merging, currency/date formatting, timestamp conversion, and label/color mappings for job status, priority, payment status, and other domain enums.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/CustomerDetail.tsx": "Displays a detailed view of a single customer including contact info, associated jobs, and invoices, with edit and delete functionality via dialogs.",
  "frontend/src/pages/Customers.tsx": "Lists all customers in a searchable, sortable table with options to add, edit, view, and delete customers using a form dialog and confirmation alert.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with KPI cards, a job status bar chart, and a recent jobs table; also seeds demo data on first load if the backend is empty.",
  "frontend/src/pages/Inventory.tsx": "Shows all inventory items in a filterable table with category and search filters, low-stock alerts, and CRUD operations via a form dialog and delete confirmation.",
  "frontend/src/pages/InventoryDetail.tsx": "Displays detailed information for a single inventory item including stock levels and a dialog to record stock usage against a job, with edit and delete support.",
  "frontend/src/pages/InvoiceDetail.tsx": "Displays a single invoice's details including line items, customer, job, and payment status, with actions to edit, delete, and mark as paid.",
  "frontend/src/pages/Invoices.tsx": "Lists all invoices with search and status filtering, summary stat cards, and actions to create, edit, delete, and mark invoices as paid.",
  "frontend/src/pages/JobDetail.tsx": "Shows a single job's full details including customer, technician, stock usage, and metadata, with edit and delete actions.",
  "frontend/src/pages/Jobs.tsx": "Lists all jobs with filters for status, priority, and technician, and supports creating, editing, and deleting jobs via a table view.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page with a marketing left panel and an Internet Identity sign-in button on the right for authentication.",
  "frontend/src/pages/Reports.tsx": "Renders a tabbed Reports & Analytics page with bar charts and tables for job status summary, revenue, technician performance, and top inventory usage, fetching data via custom query hooks.",
  "frontend/src/pages/Schedule.tsx": "Displays a monthly calendar and upcoming-list view of scheduled jobs, allowing users to navigate months, click days to create jobs, and see jobs grouped by date.",
  "frontend/src/pages/TechnicianDetail.tsx": "Shows a detailed profile page for a single technician including contact info, status, assigned/completed job counts, and actions to edit, deactivate, or delete the technician.",
  "frontend/src/pages/Technicians.tsx": "Lists all technicians in a searchable, sortable table with summary stat cards, and supports adding, editing, deactivating, and deleting technicians via dialogs and a form.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (including from hash-based routes), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (using oklch variables), fonts, shadows, border radii, and keyframe animations, plus plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the overall project state for the SKPM Technical Services Management Software, including versioning, architectural notes, known issues, image requirements, and a list of all implemented features with their IDs and requirement references."
}